---
kind: type
id: T:Autodesk.Revit.DB.PlanViewDirection
source: html/0cbd5e1c-6433-1dce-167f-cf170631c30d.htm
---
# Autodesk.Revit.DB.PlanViewDirection

This enumerated type represents the possible directions for a plan view.

## Syntax (C#)
```csharp
public enum PlanViewDirection
```